cmsis-svd/cmsis-svd/data/MindMotion/MM32F103xx.svd
        <register>
          <name>CNT</name>
          <displayName>CNT</displayName>
          <description>CNT</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CNT</name>
              <description>Counter value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <displayName>PSC</displayName>
          <description>PSC</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>PSC</name>
              <description>Prescaler value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <displayName>ARR</displayName>
          <description>ARR</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>ARR</name>
              <description>Auto reload value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <displayName>CCR1</displayName>
          <description>CCR1</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CCR1</name>
              <description>Capture/Compare 1 value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <displayName>CCR2</displayName>
          <description>CCR2</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CCR2</name>
              <description>Capture/Compare 2 value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <displayName>CCR3</displayName>
          <description>CCR3</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CCR3</name>
              <description>Capture/Compare 3 value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <displayName>CCR4</displayName>
          <description>CCR4</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>CCR4</name>
              <description>Capture/Compare 4 value</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <displayName>DCR</displayName>
          <description>DCR</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>DBL</name>
              <description>DMA burst length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DBA</name>
              <description>DMA base address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <displayName>DMAR</displayName>
          <description>DMAR</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>DMAB</name>
              <description>DMA register for burst accesses</description>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM3</name>
      <baseAddress>0x40000400</baseAddress>
      <interrupt>
        <name>TIM3</name>
        <description>TIM3 global interrupt</description>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM4</name>
      <baseAddress>0x40000800</baseAddress>
      <interrupt>
        <name>TIM4</name>
        <description>TIM4 global interrupt</description>
        <value>30</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>Inter integrated circuit</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C1_EV</name>
        <description>I2C1 event interrupt</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CON</name>
          <displayName>CON</displayName>
          <description>CON</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0011</resetValue>
          <fields>
            <field>
              <name>TX_EMPTY_CTRL</name>
              <description>"This bit controls the generation of the TX_EMPTY interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOP_DET_IFADDRESSED</name>
              <description>STOP_DET_IFADDRESSED</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC_SLAVE_DISABLE</name>
              <description>This bit controls whether I2C has its slave diabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC_RESTART_EN</name>
              <description>Determines whether RESTART comdtions may be sent when acting as a master</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC_10BITADDR_MASTER</name>
              <description>Address mode when acting as a master</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC_10BITADDR_SLAVE</name>
              <description>"When acting as a alsve</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPEED</name>
              <description>These bits control at which speed the DW_apb_i2c operates</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MASTER_MODE</name>
              <description>This bit controls whether the DW_apb_i2c master is enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <displayName>TAR</displayName>
          <description>TAR</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0055</resetValue>
          <fields>
            <field>
              <name>SPECIAL</name>
              <description>This bit indicates whether software performs a General Call or START BYTE conmmend</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GC_OR_START</name>
              <description>"If bit 11(SPECIAL)is set to 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC_TAR</name>
              <description>This is the target address for any master transaction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR</name>
          <displayName>SAR</displayName>
          <description>SAR</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <name>IC_SAR</name>
              <description>The IC_SAR holds the slave address when the i2c is operation as a slave</description>
            </field>
          </fields>
        </register>
        <register>
          <name>HS_MADDR</name>
          <displayName>HS_MADDR</displayName>
          <description>HS_MADDR</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <name>IC_HS_MAR</name>
              <description>This bit field holds the value of the I2C HS mode master mode</description>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_CMD</name>
          <displayName>DATA_CMD</displayName>
          <description>DATA_CMD</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <description>This bit controls whether a read or a write is perormed</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAT</name>
              <description>This register contains the data to be transimitted or received on the i2c bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SS_SCL_HCNT</name>
          <displayName>SS_SCL_HCNT</displayName>
          <description>SS_SCL_HCNT</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x190</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IC_SS_SCL_HCNT</name>
              <description>This register sets the SCL clock high period count for standard speed</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SS_SCL_LCNT</name>
          <displayName>SS_SCL_LCNT</displayName>
          <description>SS_SCL_LCNT</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1D6</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IC_SS_SCL_LCNT</name>
              <description>This register sets the SCL clock low period count for standard speed</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_SCL_HCNT</name>
          <displayName>FS_SCL_HCNT</displayName>
          <description>FS_SCL_HCNT</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x036</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IC_FS_SCL_HCNT</name>
              <description>This register sets the SCL clock high_period count for standard speed</description>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_SCL_LCNT</name>
          <displayName>FS_SCL_LCNT</displayName>
          <description>FS_SCL_LCNT</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x082</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IC_FS_SCL_LCNT</name>
              <description>This register sets the SCL clock low period count for standard speed</description>
            </field>
          </fields>
        </register>
        <register>
          <name>HS_SCL_HCNT</name>
          <displayName>HS_SCL_HCNT</displayName>
          <description>HS_SCL_HCNT</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x006</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IC_HS_SCL_HCNT</name>
              <description>This register sets the SCL clock high_period count for standard speed</description>
            </field>
          </fields>
        </register>
        <register>
          <name>HS_SCL_LCNT</name>
          <displayName>HS_SCL_LCNT</displayName>
          <description>HS_SCL_LCNT</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x010</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IC_HS_SCL_LCNT</name>
              <description>This register sets the SCL clock low period count for standard speed</description>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_STAT</name>
          <displayName>INTR_STAT</displayName>
          <description>INTR_STAT</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <name>IC_RAW_INTR_STAT</name>
              <description>IC_RAW_INTR_STAT</description>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MASK</name>
          <displayName>INTR_MASK</displayName>
          <description>INTR_MASK</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000</resetValue>
          <fields></fields>
        </register>
        <register>
          <name>RAW_INTR_STAT</name>
          <displayName>RAW_INTR_STAT</displayName>
          <description>RAW_INTR_STAT</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <name>GEN_CALL</name>
              <description>General call</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_DET</name>
              <description>Start condition detection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOP_DET</name>
              <description>Stop condition detection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTIVITY</name>
              <description>This bit captures DW_spb_i2c acticity and stays set until it is cleared</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_DONE</name>
              <description>Transmit done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_ABRT</name>
              <description>Transmit abort</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_REQ</name>
              <description>Read request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_EMPTY</name>
              <description>Transmit buffer empty</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_OVER</name>
              <description>Transmit buffer over</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_FULL</name>
              <description>Receive buffer not empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_OVER</name>
              <description>Receive buffer over</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_UNDER</name>
              <description>Receive buffer under</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_TL</name>
          <displayName>RX_TL</displayName>
          <description>RX_TL</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>RX_TL</name>
              <description>Receive FIFO threshold level</description>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_TL</name>
          <displayName>TX_TL</displayName>
          <description>TX_TL</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>TX_TL</name>
              <description>Transmit FIFO threshold level</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR_INTR</name>
          <displayName>CLR_INTR</displayName>
          <description>CLR_INTR</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>CLR_INTR</name>
              <description>"Read this register to clear the combined interrupt</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR_RX_UNDER</name>
          <displayName>CLR_RX_UNDER</displayName>
          <description>CLR_RX_UNDER</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>CLR_RX_UNDER</name>
              <description>Read this register to clear the RX_UNDER interrupt(bit 0)of the IC_RAW_INTR_STAT register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR_RX_OVER</name>
          <displayName>CLR_RX_OVER</displayName>
          <description>CLR_RX_OVER</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>CLR_RX_OVER</name>
              <description>Read this register to clear the RX_UNDER interrupt(bit 1)of the IC_RAW_INTR_STAT register</description>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR_TX_OVER</name>
          <displayName>CLR_TX_OVER</displayName>
          <description>CLR_TX_OVER</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <name>CLR_TX_OVER</name>
              <description>Read this register to clear the RX_UNDER interrupt(bit 3)of the IC_RAW_INTR_STAT register</description>
            </field>
          </fields>
        </register>
