cmsis-svd/cmsis-svd/data/MindMotion/MM32F103xx.svd
        <register>
          <name>EP4_INT_STATE</name>
          <displayName>EP4_INT_STATE</displayName>
          <description>EP4_INT_STATE</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OUT_STALL</name>
              <description>OUT-STALL received</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_ACK</name>
              <description>OUT-ACK received</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_NACK</name>
              <description>OUT-NACK received</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_STALL</name>
              <description>IN-STALL received</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_ACK</name>
              <description>IN-ACK received</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_NACK</name>
              <description>IN-NACK received</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>END</name>
              <description>Transfer finished</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP1_INT_EN</name>
          <displayName>EP1_INT_EN</displayName>
          <description>EP1_INT_EN</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OUT_STALL</name>
              <description>OUT-STALL interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_ACK</name>
              <description>OUT-ACK interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_NACK</name>
              <description>OUT-NACK interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_STALL</name>
              <description>IN-STALL interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_ACK</name>
              <description>IN-ACK interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_NACK</name>
              <description>IN-NACK interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDIE</name>
              <description>Finished interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP2_INT_EN</name>
          <displayName>EP2_INT_EN</displayName>
          <description>EP2_INT_EN</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OUT_STALL</name>
              <description>OUT-STALL interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_ACK</name>
              <description>OUT-ACK interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_NACK</name>
              <description>OUT-NACK interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_STALL</name>
              <description>IN-STALL interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_ACK</name>
              <description>IN-ACK interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_NACK</name>
              <description>IN-NACK interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDIE</name>
              <description>Finished interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP3_INT_EN</name>
          <displayName>EP3_INT_EN</displayName>
          <description>EP3_INT_EN</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OUT_STALL</name>
              <description>OUT-STALL interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_ACK</name>
              <description>OUT-ACK interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_NACK</name>
              <description>OUT-NACK interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_STALL</name>
              <description>IN-STALL interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_ACK</name>
              <description>IN-ACK interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_NACK</name>
              <description>IN-NACK interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDIE</name>
              <description>Finished interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP4_INT_EN</name>
          <displayName>EP4_INT_EN</displayName>
          <description>EP4_INT_EN</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OUT_STALL</name>
              <description>OUT-STALL interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_ACK</name>
              <description>OUT-ACK interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT_NACK</name>
              <description>OUT-NACK interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_STALL</name>
              <description>IN-STALL interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_ACK</name>
              <description>IN-ACK interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IN_NACK</name>
              <description>IN-NACK interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDIE</name>
              <description>Finished interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <displayName>ADDR</displayName>
          <description>ADDR</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <name>ADDR</name>
              <description>USB address</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP_EN</name>
          <displayName>EP_EN</displayName>
          <description>EP_EN</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>EP4EN</name>
              <description>Enable End Point 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP3EN</name>
              <description>Enable End Point 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP2EN</name>
              <description>Enable End Point 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP1EN</name>
              <description>Enable End Point 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EP0EN</name>
              <description>Enable End Point 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TOG_CTRL1_4</name>
          <displayName>TOG_CTRL1_4</displayName>
          <description>TOG_CTRL1_4</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>DTOG4EN</name>
              <description>Set End Point 4 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTOG4</name>
              <description>Set End Point 4 Toggle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTOG3EN</name>
              <description>Set End Point 3 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTOG3</name>
              <description>Set End Point 3 Toggle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTOG2EN</name>
              <description>Set End Point 2 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTOG2</name>
              <description>Set End Point 2 Toggle</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTOG1EN</name>
              <description>Set End Point 1 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTOG1</name>
              <description>Set End Point 1 Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP0</name>
          <displayName>SETUP0</displayName>
          <description>SETUP0</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD0</name>
              <description>Setup Data 0</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP1</name>
          <displayName>SETUP1</displayName>
          <description>SETUP1</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD1</name>
              <description>Setup Data 1</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP2</name>
          <displayName>SETUP2</displayName>
          <description>SETUP2</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD2</name>
              <description>Setup Data 2</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP3</name>
          <displayName>SETUP3</displayName>
          <description>SETUP3</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD3</name>
              <description>Setup Data 3</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP4</name>
          <displayName>SETUP4</displayName>
          <description>SETUP4</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD4</name>
              <description>Setup Data 4</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP5</name>
          <displayName>SETUP5</displayName>
          <description>SETUP5</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD5</name>
              <description>Setup Data 5</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP6</name>
          <displayName>SETUP6</displayName>
          <description>SETUP6</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD6</name>
              <description>Setup Data 6</description>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP7</name>
          <displayName>SETUP7</displayName>
          <description>SETUP7</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SETUPD7</name>
              <description>Setup Data 7</description>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_SIZE</name>
          <displayName>PACKET_SIZE</displayName>
          <description>PACKET_SIZE</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>SIZE0</name>
              <description>USB DMA Max Packet Size</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP0_AVAIL</name>
          <displayName>EP0_AVAIL</displayName>
          <description>EP0_AVAIL</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP0AVIL</name>
              <description>EP0 FIFO available data number</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP1_AVAIL</name>
          <displayName>EP1_AVAIL</displayName>
          <description>EP1_AVAIL</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP1AVIL</name>
              <description>EP1 FIFO available data number</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP2_AVAIL</name>
          <displayName>EP2_AVAIL</displayName>
          <description>EP2_AVAIL</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP2AVIL</name>
              <description>EP2 FIFO available data number</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP3_AVAIL</name>
          <displayName>EP3_AVAIL</displayName>
          <description>EP3_AVAIL</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP3AVIL</name>
              <description>EP3 FIFO available data number</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP4_AVAIL</name>
          <displayName>EP4_AVAIL</displayName>
          <description>EP4_AVAIL</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <name>EP4AVIL</name>
              <description>EP4 FIFO available data number</description>
            </field>
          </fields>
        </register>
        <register>
          <name>EP0_CTRL</name>
          <displayName>EP0_CTRL</displayName>
          <description>EP0_CTRL</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TRANEN</name>
              <description>EP0 transfer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRANCOUNT</name>
              <description>EP0 transfer counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EP1_CTRL</name>
          <displayName>EP1_CTRL</displayName>
          <description>EP1_CTRL</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TRANEN</name>
              <description>EP1 transfer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRANCOUNT</name>
              <description>EP1 transfer counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
